configuration/src/Catalogs/QuestionnaireAnswersOptions/QuestionnaireAnswersOptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>QuestionnaireAnswersOptions</name>
  <owners>ChartOfCharacteristicTypes.QuestionsForSurvey</owners>
  <attributes>
    <name>OpenEndedQuestion</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AddlOrderingAttribute</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToolTip</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Enums/TypesOfAnswersToQuestion/TypesOfAnswersToQuestion.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfAnswersToQuestion</name>
  <enumValues>
    <name>String</name>
  </enumValues>
  <enumValues>
    <name>Text</name>
  </enumValues>
  <enumValues>
    <name>Number</name>
  </enumValues>
  <enumValues>
    <name>Date</name>
  </enumValues>
  <enumValues>
    <name>Boolean</name>
  </enumValues>
  <enumValues>
    <name>InfobaseValue</name>
  </enumValues>
  <enumValues>
    <name>OneVariantOf</name>
  </enumValues>
  <enumValues>
    <name>MultipleOptionsFor</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/QuestionnaireAnswersOptions/Forms/ItemForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	If Parameters.Property("Owner")
		And TypeOf(Parameters.Owner) = Type("ChartOfCharacteristicTypesRef.QuestionsForSurvey")
		And Not Parameters.Owner.IsEmpty() Then

		Object.Owner = Parameters.Owner;

	Else

		MessageText = NStr("en = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".';");
		Common.MessageToUser(MessageText);
		Cancel = True;
		Return;

	EndIf;

	If Parameters.Property("ReplyType") Then
		Items.OpenEndedQuestion.Visible = (Parameters.ReplyType = Enums.TypesOfAnswersToQuestion.MultipleOptionsFor);
	Else
		Items.OpenEndedQuestion.Visible = (Object.Owner.ReplyType = Enums.TypesOfAnswersToQuestion.MultipleOptionsFor);
	EndIf;

	If Parameters.Property("Description") Then
		Object.Description = Parameters.Description;
	EndIf;

EndProcedure

#EndRegion
